FoxDeser/MCU1/stm32f4xx_drivers/Src/013uart_tx.c
/*
 * 013uart_tx.c
 *
 *  Created on: Mar 25, 2024
 *      Author: thaithinhtran
 */

#include <stdio.h>
#include <string.h>
#include "stm32f407xx.h"
#include "stm32f407xx_usart_driver.h"
#include "stm32f407xx_gpio_driver.h"

char msg[1024] = "Tran Thi Anh Thi...\n\r";

USART_Handle_t usart2_handle;

void USART2_Init(void)
{
	usart2_handle.pUSARTx = USART2;
	usart2_handle.USART_Config.USART_Baud = USART_STD_BAUD_115200;
	usart2_handle.USART_Config.USART_HWFlowControl = USART_HW_FLOW_CTRL_NONE;
	usart2_handle.USART_Config.USART_Mode = USART_MODE_ONLY_TX;
	usart2_handle.USART_Config.USART_NoOfStopBits = USART_STOPBITS_1;
	usart2_handle.USART_Config.USART_WordLength = USART_WORDLEN_8BITS;
	usart2_handle.USART_Config.USART_ParityControl = USART_PARITY_DISABLE;
	USART_Init(&usart2_handle);
}

void USART2_GPIOInit(void)
{
	GPIO_Handler_t usart_gpios;

	usart_gpios.pGPIOx = GPIOA;
	usart_gpios.GPIO_Pinconfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	usart_gpios.GPIO_Pinconfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	usart_gpios.GPIO_Pinconfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
	usart_gpios.GPIO_Pinconfig.GPIO_pinSpeed = GPIO_SPEED_FAST;
	usart_gpios.GPIO_Pinconfig.GPIO_PinAltMode =7;

	//USART2 TX
	usart_gpios.GPIO_Pinconfig.GPIO_PinNumber  = GPIO_PIN_NO_2;
	GPIO_Init(&usart_gpios);

	//USART2 RX
	usart_gpios.GPIO_Pinconfig.GPIO_PinNumber = GPIO_PIN_NO_3;
	GPIO_Init(&usart_gpios);
}

void GPIO_ButtonInit(void)
{
	GPIO_Handler_t GPIOBtn,GpioLed;

	//this is btn gpio configuration
	GPIOBtn.pGPIOx = GPIOA;
	GPIOBtn.GPIO_Pinconfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GPIOBtn.GPIO_Pinconfig.GPIO_PinMode = GPIO_MODE_IN;
	GPIOBtn.GPIO_Pinconfig.GPIO_pinSpeed = GPIO_SPEED_FAST;
	GPIOBtn.GPIO_Pinconfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&GPIOBtn);

	//this is led gpio configuration
	GpioLed.pGPIOx = GPIOD;
	GpioLed.GPIO_Pinconfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GpioLed.GPIO_Pinconfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_Pinconfig.GPIO_pinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_Pinconfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	GpioLed.GPIO_Pinconfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_PeriClockControl(GPIOD,ENABLE);
	GPIO_Init(&GpioLed);
}

void delay(void)
{
	for(uint32_t i = 0 ; i < 500000/2 ; i ++);
}


int main(void)
{

	GPIO_ButtonInit();
	USART2_GPIOInit();
    USART2_Init();
    USART_PeripheralControl(USART2,ENABLE);

    while(1)
    {
		//wait till button is pressed
		while( ! GPIO_ReadFromInputPin(GPIOA,GPIO_PIN_NO_0) );

		//to avoid button de-bouncing related issues 200ms of delay
		delay();

		USART_SendData(&usart2_handle,(uint8_t*)msg,strlen(msg));

    }
	return 0;
}
